import pandas as pd
leagues = {
    'Страны': ["Албания", "Армения", "Австрия", "Азербайжан", "Беларусь", "Бельгия", "Босния", "Болгария", "Хорватия",
               "Кипр", "Чехия", "Дания", "Германия", "Нидерланды", "Англия", "Эстония", "Фареры", "Финляндия", 
               "Франция", "Грузия", "Греция", "Венгрия", "Ирландия", "Исландия", "Италия", "Израиль", "Казахстан", 
               "Косово", "Македония", "Молдова", "Черногория", "Норвегия", "Польша", "Португалия", "Румыния", "Россия", 
               "Шотландия", "Сербия", "Словакия", "Словения", "Испания", "Швеция", "Швейцария", "Турция", "Украина"],
    'Баллы квалификации': ["3000", "4000", "11000", "5625", "2000", "14375", "3750", "3375", "7500",
                            "6500", "9500", "10625", "32625", "15125", "37625", "2750", "3000", "3250",
                            "24875", "2625", "10625", "5875", "3875", "3000", "31500", "5000", "3125",
                            "3500", "2500", "5125", "2125", "6750", "6000", "16500", "3875", "11000",
                            "11375", "5500", "5250", "6000", "30000", "4750", "10000", "8625", "6500"],
}
df = pd.DataFrame(leagues)
df['Баллы квалификации'] = df['Баллы квалификации'].astype(int)
df = df.sort_values(by=['Баллы квалификации', 'Страны'], ascending=False)
sorted_leagues = pd.DataFrame()
sorted_leagues = pd.concat([sorted_leagues, df], ignore_index=True)
def print_leagues():
    print(sorted_leagues.to_string())
def return_nation_power(club):
    i = 0
    while i < len(df["Страны"]):
        if club[2] == df["Страны"][i]:
            return(df['Баллы квалификации'][i])
        i += 1
