import games
import pandas as pd
albanian_league = {
    'Клубы': ["Теута", "Динамо Сити", "Влазния Шкодер", "Партизани", "Тирана",  
              "Бюлис Бельш", "Эльбасани", "Скендербеу", "КФ Лачи", "Эгнатия"],
    'Евроочки': ["2000", "2500", "6500", "7500", "4000",
                 "0", "0", "0", "3500", "4500"], 
    'Очки силы': [6, 3, 8, 10, 7,
                  3, 5, 4, 7, 9],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, albanian_league)
df = pd.DataFrame(albanian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, albanian_league, "Албания")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Албания"
