import games
import pandas as pd
armenian_league = {
    'Клубы': ["Ноа Ереван", "Арарат-Армения", "Урарту", "Алашкерт", "Ван", 
              "ЦСКА Ереван", "Ширак", "Арарат Ереван", "Пюник", "Вест Армения"],
    'Евроочки': ["10750", "7000", "5000", "5000", "0",
                 "0", "0", "2500", "10000", "0"], 
    'Очки силы': [9, 7, 7, 6, 5,
                  6, 4, 5, 10, 3],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, armenian_league)
df = pd.DataFrame(armenian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, armenian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]
