import games
import pandas as pd
azerbaijanian_league = {
    'Клубы': ["Сабах", "Карабах", "Кяпаз", "Карван",
              "Нефтчи", "Шамахы", "Имишли", "Араз",
              "Габала", "Сумгаит", "Зиря", "Туран"],
    'Евроочки': ["6000", "40000", "0", "0",
                 "6500", "1500", "0", "2000", 
                 "3000", "3000", "5500", "0"], 
    'Очки силы': [8, 10, 3, 3,
                  7, 2, 2, 2,
                  5, 4, 7, 4],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 12, azerbaijanian_league)
df = pd.DataFrame(azerbaijanian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(12, azerbaijanian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]