import games
import pandas as pd
bosnian_league = {
    'Клубы': ["Сараево", "Зриньски Мостар", "Борац", "Железничар", "Вележ",
              "Широки Бриег", "Рудар", "Посушье", "Слога Меридиан", "Радник"],
    'Евроочки': ["5000", "12000", "13125", "2500", "4500",
                 "1000", "0", "0", "0", "0"], # сила лиги 3750
    'Очки силы': [8, 10, 9, 7, 7,
                  6, 3, 5, 4, 4],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, bosnian_league)
df = pd.DataFrame(bosnian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, bosnian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]