import games
import pandas as pd
bulgarian_league = {
    'Клубы': ["Лудогорец", "Левски Крумовград", "Ботев Пловдив", "Септември", "ЦСКА София",
              "Локомотив Пловдив", "Черно море", "Ботев Враца", "Спартак Варна", "Хебар",
              "Арда", "ЦСКА 1948", "Локомотив София", "Берое", "Левски София", "Славия София"],
    'Евроочки': ["26000", "7000", "3500", "0", "6500", 
                 "2000", "3000", "0", "0", "0", 
                 "4000", "3500", "0", "0", "0", "0"],
    'Очки силы': [10, 3, 6, 3, 8,
                  7, 6, 4, 2, 4, 
                  5, 6, 4, 2, 7, 5],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 16, bulgarian_league)
df = pd.DataFrame(bulgarian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(16, bulgarian_league, "Болгария")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Болгария"
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1], "Болгария"