import games
import pandas as pd
cypriot_league = {
    'Клубы': ["АПОЭЛ", "Омония", "АЕК Ларнака", "Арис Лимасол", "Аполлон",
              "Пафос", "Анортосис", "Неа Саламина", "Этникос", "Докса Катокопиас",
              "Кармиотисса-Пано Полемиди", "АЕЛ", "Олимпиакос Никосия", "Ая Напа"],
    'Евроочки': ["14750", "20375", "14500", "6500", "6500", 
                 "22125", "5000", "0", "0", "0", 
                 "0", "2000", "0", "0"], 
    'Очки силы': [10, 9, 9, 7, 7,
                  8, 6, 4, 3, 2, 
                  3, 5, 3, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 14, cypriot_league)
df = pd.DataFrame(cypriot_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(14, cypriot_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0]) or cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        cup_winner = df['Клубы'][1], df["Евроочки"][1] 
    return cup_winner
def conference_qual_1():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        return df['Клубы'][2], df["Евроочки"][2]
    else:
        return df['Клубы'][1], df["Евроочки"][1]
def conference_qual_2():
    if conference_qual_1() == (df['Клубы'][2], df["Евроочки"][2]):
        return df['Клубы'][3], df["Евроочки"][3]
    else:
        return df['Клубы'][2], df["Евроочки"][2]