import games
import pandas as pd
faroe_league = {
    'Клубы': ["КИ Клаксвик", "ХБ Торсхавн", "Скала Итроттарфелаг", "Б-36", "НСИ Рунавик", 
              "ЭБ/Стреймур", "Б-68 Тофтир", "07 Вестус", "Фуглафьердур", "Викингур Гота"],
    'Евроочки': ["10500", "7000", "0", "5000", "2000",
                 "0", "0", "0", "0", "6000"], 
    'Очки силы': [10, 9, 4, 7, 5,
                  6, 4, 5, 3, 8],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, faroe_league)
df = pd.DataFrame(faroe_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, faroe_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
