import games
import pandas as pd
irish_league = {
    'Клубы': ["Шемрок Роверс", "Богемианс", "Слайго Роверс", "Уотерфорд Юнайтед", "Корк Сити",
              "Ст.Патрикс Атлетик", "Шелбурн", "Гэлвэй Юнайтед", "Дроэда Юнайтед", "Дерри Сити"],
    'Евроочки': ["19375", "2000", "3000", "0", "0",
                 "7500", "3500", "0", "0", "4000"], 
    'Очки силы': [10, 6, 4, 3, 4,
                  7, 6, 5, 5, 8],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, irish_league)
df = pd.DataFrame(irish_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, irish_league, "Ирландия")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Ирландия"
