import games
import pandas as pd
islandian_league = {
    'Клубы': ["Викингур Рейкьявик", "Фрам", "Брейдаблик", "Валюр",
              "Хабнарфьордюр", "Акурейри", "Акранес", "Филкир",
              "КР Рейкьявик", "Коупавогюр", "Стьярнан", "Вестри"],
    'Евроочки': ["11750", "0", "12000", "4500",
                 "1500", "3500", "0", "0", 
                 "1000", "0", "2500", "0"],
    'Очки силы': [10, 5, 8, 9,
                  7, 6, 4, 4,
                  6, 3, 6, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 12, islandian_league)
df = pd.DataFrame(islandian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(12, islandian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]