import games
import pandas as pd
italian_league = {
    'Клубы': ["Интер", "Рома", "Лацио", "Кремонезе", "Сассуоло", 
              "Аталанта", "Комо", "Наполи", "Ювентус", "Торино", 
              "Удинезе", "Милан", "Болонья", "Лечче", "Кальяри", 
              "Дженоа", "Парма", "Верона", "Пиза", "Фиорентина"],
    'Евроочки': ["121250", "88500", "59000", "0", "0", 
                 "80000", "0", "62000", "66250", "0", 
                 "0", "66000", "19000", "0", "0", 
                 "0", "0", "0", "0", "69250"], # сила лиги 31500
    'Очки силы': [10, 7, 8, 3, 2, 
                  8, 7, 9, 9, 6, 
                  4, 9, 7, 4, 3, 
                  5, 2, 4, 2, 6],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 20, italian_league)
df = pd.DataFrame(italian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(20, italian_league)
def champions_qual_1():
    return df['Клубы'][0], df["Евроочки"][0]
def champions_qual_2():
    return df['Клубы'][1], df["Евроочки"][1]
def champions_qual_3():
    return df['Клубы'][2], df["Евроочки"][2]
def champions_qual_4():
    return df['Клубы'][3], df["Евроочки"][3]
def europe_qual():
    return df['Клубы'][4], df["Евроочки"][4]
def europe_qual_cup():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0]) or cup_winner == (df['Клубы'][1], df["Евроочки"][1]) or cup_winner == (df['Клубы'][2], df["Евроочки"][2]) or cup_winner == (df['Клубы'][3], df["Евроочки"][3]) or cup_winner == (df['Клубы'][4], df["Евроочки"][4]) or cup_winner == (df['Клубы'][5], df["Евроочки"][5]):
        cup_winner = df['Клубы'][5], df["Евроочки"][5] 
    return cup_winner
def conference_qual():
    if europe_qual_cup() == (df['Клубы'][5], df["Евроочки"][5]):
        return df['Клубы'][6], df["Евроочки"][6]
    else:
        return df['Клубы'][5], df["Евроочки"][5]