import games
import pandas as pd
jewish_league = {
    'Клубы': ["Хапоэль Эран Хадера", "Хапоэль Беэр-Шева", "Хапоэль Иерусалим", "Хапоэль Хайфа",
              "Маккаби Хайфа", "Маккаби Нетания", "Маккаби Тель-Авив", "Маккаби Петах-Тиква", "Ашдод",
              "Маккаби Бней-Рейна", "Ирони Кирьят-Шмона", "Ирони Тибериас", "Бейтар", "Бней Сахнин"],
    'Евроочки': ["0", "14000", "0", "0",
                 "17500", "1500", "30500", "2000", "1500", 
                 "0", "0", "0", "3500", "0"], # сила лиги 5000
    'Очки силы': [4, 8, 4, 7,
                  10, 5, 9, 4, 5, 
                  2, 4, 2, 3, 6],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 14, jewish_league)
df = pd.DataFrame(jewish_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(14, jewish_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual_1():
    return df['Клубы'][1], df["Евроочки"][1]
def conference_qual_2():
    return df['Клубы'][2], df["Евроочки"][2]