import games
import pandas as pd
kazakh_league = {
    'Клубы': ["Кайрат", "Астана", "Тобол", "Актобе", "Елимай",
              "Женис", "Ордабасы", "Окжетпес", "Кызыл‑Жар", "Улытау",
              "Жетысу", "Кайсар", "Атырау", "Шахтер Караганда"],
    'Евроочки': ["11000", "12500", "8000", "4500", "0", 
                 "0", "4500", "0", "2000", "0", 
                 "0", "0", "0", "2500"],
    'Очки силы': [10, 9, 9, 8, 8,
                  7, 7, 6, 5, 4, 
                  4, 4, 3, 5],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 14, kazakh_league)
df = pd.DataFrame(kazakh_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(14, kazakh_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0]) or cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        cup_winner = df['Клубы'][1], df["Евроочки"][1] 
    return cup_winner
def conference_qual():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        return df['Клубы'][2], df["Евроочки"][2]
    else:
        return df['Клубы'][1], df["Евроочки"][1]