import games
import pandas as pd
kosovar_league = {
    'Клубы': ["Дрита", "Балкани", "Приштина", "Лапи", "Малишево",
              "Гиляни", "Дукаджини", "Феризай", "Сухарека", "Ферроникели"],
    'Евроочки': ["13000", "10000", "3500", "3500", "2000",
                 "2000", "1500", "0", "0", "0"],
    'Очки силы': [10, 8, 9, 6, 8,
                  7, 6, 5, 4, 3],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, kosovar_league)
df = pd.DataFrame(kosovar_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, kosovar_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]