import games
import pandas as pd
makedonian_league = {
    'Клубы': ["Струга", "Вардар", "Шкендия", "Силекс", "Башкими", "Македония",
               "Академия Пандев", "Арсими", "Тиквеш", "Пелистер", "Работнички", "Шкупи"],
    'Евроочки': ["5000", "1500", "10500", "2000", "0", "2500",
                  "1000", "0", "1000", "0", "1000", "5500"], 
    'Очки силы': [8, 8, 10, 7, 7, 7, 
                  5, 5, 4, 6, 6, 9],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 12, makedonian_league)
df = pd.DataFrame(makedonian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, makedonian_league, "Македония")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Македония"