import games
import pandas as pd
polish_league = {
    'Клубы': ["Лех Познань", "Радомяк Радом", "Видзев Лодзь", "Краковия", "Шленск", "Легия",
              "Мотор Люблин", "Корона Кельце", "Сталь Мелец", "Катовице", "Погонь", "Пуща",
              "Гурник Забже", "Лехия Гданськ", "Заглембе Л", "Ягеллония", "Пяст", "Ракув"],
    'Евроочки': ["24759", "0", "0", "0", "4000", "32500", 
                 "0", "0", "0", "0", "5000", "0", 
                 "0", "0", "0", "22000", "0", "21750"], 
    'Очки силы': [9, 3, 4, 3, 6, 10,
                  2, 5, 5, 2, 7, 3, 
                  6, 3, 4, 8, 6, 8],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 18, polish_league)
df = pd.DataFrame(polish_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(18, polish_league, "Польша")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Польша"
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Польша") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Польша"):
        cup_winner = df['Клубы'][1], df["Евроочки"][1], "Польша"
    return cup_winner
def conference_qual_1():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Польша"):
        return df['Клубы'][2], df["Евроочки"][2], "Польша"
    else:
        return df['Клубы'][1], df["Евроочки"][1], "Польша"
def conference_qual_2():
    if conference_qual_1() == (df['Клубы'][2], df["Евроочки"][2], "Польша"):
        return df['Клубы'][3], df["Евроочки"][3], "Польша"
    else:
        return df['Клубы'][2], df["Евроочки"][2], "Польша"