import games
import pandas as pd
russian_league = {
    'Клубы': ["Зенит", "ЦСКА Москва", "Спартак Москва", "Динамо Москва", "Локомотив Москва",
              "Краснодар", "Рубин", "Ростов", "Акрон", "Крылья Советов", "Динамо Махачкала",
              "Сочи", "Пари Нижний Новгород", "Ахмат", "Оренбург", "Факел"],
    'Евроочки': ["46000", "33000", "29500", "1500", "34000", 
                 "26500", "2000", "2000", "0", "0", "0",
                 "2000", "0", "0", "0", "0"], # сила лиги 11000
    'Очки силы': [10, 8, 6, 7, 7,
                  9, 8, 6, 5, 4, 4,
                  3, 5, 3, 3, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 16, russian_league)
df = pd.DataFrame(russian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(16, russian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0]) or cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        cup_winner = df['Клубы'][1], df["Евроочки"][1] 
    return cup_winner
def conference_qual_1():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        return df['Клубы'][2], df["Евроочки"][2]
    else:
        return df['Клубы'][1], df["Евроочки"][1]
def conference_qual_2():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        return df['Клубы'][3], df["Евроочки"][3]
    else:
        return df['Клубы'][2], df["Евроочки"][2]