import games
import pandas as pd
scottish_league = {
    'Клубы': ["Селтик", "Рейнджерс", "Хиберниан", "Сент-Миррен",
              "Данди Юнайтед", "Росс Каунти", "Килмарнок", "Хартс",
              "Сент-Джонстон", "Мотеруэлл", "Ливингстон", "Абердин"],
    'Евроочки': ["40000", "57250", "7000", "2000",
                 "4000", "0", "2500", "11500", 
                 "2500", "1500", "0", "9500"], 
    'Очки силы': [10, 10, 6, 5,
                  4, 4, 5, 8,
                  3, 5, 2, 7],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 12, scottish_league)
df = pd.DataFrame(scottish_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(12, scottish_league, "Шотландия")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Шотландия"
def europe_qual():
    return df['Клубы'][1], df["Евроочки"][1], "Шотландия"
def conference_qual():
    return df['Клубы'][2], df["Евроочки"][2], "Шотландия"