import games
import pandas as pd
serbian_league = {
    'Клубы': ["Црвена Звезда", "Партизан", "ОФК Белград", "Раднички 1923", "Нови Пазар", 
              "Младост", "Железничар Панчево", "Единство", "Воеводина", "Спартак Суботица",
              "Чукарички", "Раднички Н", "Напредак", "ИМТ Белград", "Бачка Топола", "Текстилац"],
    'Евроочки': ["41000", "22000", "0", "3000", "1500", 
                 "0", "0", "0", "5500", "0", 
                 "6500", "1500", "0", "0", "8125", "0"], # сила лиги 5500
    'Очки силы': [10, 9, 3, 6, 4,
                  4, 3, 2, 6, 4, 
                  8, 3, 5, 2, 7, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 16, serbian_league)
df = pd.DataFrame(serbian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(16, serbian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual_1():
    return df['Клубы'][1], df["Евроочки"][1]
def conference_qual_2():
    return df['Клубы'][2], df["Евроочки"][2]