import games
import pandas as pd
slovakian_league = {
    'Клубы': ["Слован Братислава", "Спартак Трнава", "Кошице", "Тренчин",
              "Железьярне Подбрезова", "Михайловце", "ДАК 1904", "Жилина",
              "Дукла Банска-Бистрица", "Ружомберок", "Комарно", "Скалица"],
    'Евроочки': ["36000", "10500", "1500", "0",
                 "0", "0", "6000", "5500", 
                 "0", "4000", "0", "0"],
    'Очки силы': [10, 8, 5, 6,
                  3, 4, 6, 7,
                  6, 6, 2, 3],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 12, slovakian_league)
df = pd.DataFrame(slovakian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(12, slovakian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0]) or cup_winner == (df['Клубы'][1], df["Евроочки"][1]):
        cup_winner = df['Клубы'][1], df["Евроочки"][1] 
    return cup_winner