import games
import pandas as pd
turkish_league = {
    'Клубы': ["Истанбулспор", "Галатасарай", "Бодрумспор", "Фенербахче", "Трабзонспор",
              "Кайсериспор", "Самсунспор", "Адана Демирспор", "Аланьяспор", "Коньяспор",
              "Истанбул Башакшехир", "Бешикташ", "Касымпаша", "Сивасспор", "Хатайспор", 
              "Анкарагюджю", "Ризеспор", "Фатих Карагумрук", "Антальяспор", "Газиантеп"],
    'Евроочки': ["0", "47750", "0", "55250", "11000", 
                 "0", "8625", "2500", "0", "2000", 
                 "19500", "15500", "0", "12500", "0", 
                 "0", "0", "0", "0", "0"], 
    'Очки силы': [2, 10, 2, 10, 8, 
                  5, 5, 6, 6, 5, 
                  7, 9, 3, 5, 3, 
                  3, 4, 5, 6, 4],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 20, turkish_league)
df = pd.DataFrame(turkish_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(20, turkish_league, "Турция")
def champions_qual_1():
    return df['Клубы'][0], df["Евроочки"][0], "Турция"
def champions_qual_2():
    return df['Клубы'][1], df["Евроочки"][1], "Турция"
def europe_qual():
    return df['Клубы'][2], df["Евроочки"][2], "Турция"
def europe_qual_cup():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Турция") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Турция") or cup_winner == (df['Клубы'][2], df["Евроочки"][2], "Турция") or cup_winner == (df['Клубы'][3], df["Евроочки"][3], "Турция"):
        cup_winner = df['Клубы'][3], df["Евроочки"][3], "Турция" 
    return cup_winner
def conference_qual_1():
    if europe_qual_cup() == (df['Клубы'][3], df["Евроочки"][3], "Турция"):
        return df['Клубы'][4], df["Евроочки"][4], "Турция"
    else:
        return df['Клубы'][3], df["Евроочки"][3], "Турция"
def conference_qual_2():
    if europe_qual_cup() == (df['Клубы'][3], df["Евроочки"][3], "Турция"):
        return df['Клубы'][5], df["Евроочки"][5], "Турция"
    else:
        return df['Клубы'][4], df["Евроочки"][4], "Турция"