import games
import pandas as pd
belarussian_league = {
    'Клубы': ["Динамо Минск", "Славия Мозырь", "МЛ Витебск", "Динамо Брест", "Ислочь",
              "Торпедо-БелАЗ", "Неман", "Шахтер Солигорск", "Гомель", "Минск",
              "Арсенал Дзержинск", "Витебск", "Нафтан", "Днепр", "Белшина", "БАТЭ"],
    'Евроочки': ["6500", "0", "0", "2500", "1000", 
                 "5500", "6000", "3500", "1500", "0", 
                 "0", "0", "0", "0", "0", "5500"],
    'Очки силы': [10, 8, 9, 7, 7,
                  7, 7, 8, 6, 6, 
                  5, 5, 4, 6, 5, 6],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 16, belarussian_league)
df = pd.DataFrame(belarussian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(16, belarussian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]
def pretenders_qual():
    return df['Клубы'][2], df["Евроочки"][2]
