import games
import pandas as pd
hungarian_league = {
    'Клубы': ["Ференцварош", "Пушкаш Академия", "МТК", "Дьёр",
              "Диошдьёр", "Ньиредьхаза", "Уйпешт", "Фехервар",
              "Залаэгерсег", "Кечкемет", "Дебрецен", "Пакш"],
    'Евроочки': ["44000", "7000", "0", "2500",
                 "0", "0", "2000", "5500", 
                 "1500", "1500", "2000", "4500"],
    'Очки силы': [10, 8, 7, 5,
                  4, 4, 6, 6,
                  3, 5, 7, 6],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 12, hungarian_league)
df = pd.DataFrame(hungarian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(12, hungarian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]