import games
import pandas as pd
montenegrin_league = {
    'Клубы': ["Будучность", "Арсенал Тиват", "Езеро", "Отрант-Олимпик", "Морнар", 
              "Бокель", "Единство Биело-Поле", "Петровац", "Сутьеска", "Дечич"],
    'Евроочки': ["7500", "1000", "0", "0", "2000",
                 "0", "0", "0", "6000", "5500"],
    'Очки силы': [10, 4, 3, 3, 5,
                  2, 5, 6, 8, 7],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, montenegrin_league)
df = pd.DataFrame(montenegrin_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, montenegrin_league)
def pretenders_qual():
    return df['Клубы'][0], df["Евроочки"][0]
