import games
import pandas as pd
ukrainian_league = {
    'Клубы': ["Динамо Киев", "Полесье", "Александрия", "Левый Берег", "Карпаты",
              "Черноморец", "Шахтер Донецк", "Рух Львов", "Ингулец", "Кривбасс",
              "Колос", "Заря", "Верес", "Оболонь", "Ворскла", "Днепр-1"],
    'Евроочки': ["17500", "4000", "1500", "0", "0", 
                 "0", "49750", "0", "0", "2500", 
                 "2000", "12000", "0", "0", "4500", "10500"],
    'Очки силы': [9, 3, 4, 5, 3,
                  4, 10, 6, 2, 7, 
                  5, 8, 3, 4, 6, 7],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 16, ukrainian_league)
df = pd.DataFrame(ukrainian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(16, ukrainian_league)
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0]
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1]