import games
import pandas as pd
deutch_league = {
    'Клубы': ["Бавария", "Боруссия Дортмунд", "Фрайбург", "РБ Лейпциг", "Хоффенхайм", "Штутгарт", 
              "Айнтрахт Франкфурт", "Майнц", "Байер", "Вердер", "Кёльн", "Боруссия Мёнхенгладбах", 
              "Гамбург", "Вольфсбург", "Аугсбург", "Санкт-Паули", "Хайденхайм", "Унион Берлин"],
    'Евроочки': ["124250", "98750", "38000", "61000", "7000", "21000", 
                 "83000", "11500", "98250", "0", "6000", "0", 
                 "0", "8000", "0", "0", "8125", "23000"], 
    'Очки силы': [10, 9, 6, 8, 7, 8,
                  8, 4, 9, 5, 3, 4, 
                  3, 5, 5, 2, 5, 4],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 18, deutch_league)
df = pd.DataFrame(deutch_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(18, deutch_league, "Германия")
def champions_qual_1():
    return df['Клубы'][0], df["Евроочки"][0], "Германия"
def champions_qual_2():
    return df['Клубы'][1], df["Евроочки"][1], "Германия"
def champions_qual_3():
    return df['Клубы'][2], df["Евроочки"][2], "Германия"
def champions_qual_4():
    return df['Клубы'][3], df["Евроочки"][3], "Германия"
def europe_qual():
    return df['Клубы'][4], df["Евроочки"][4], "Германия"
def europe_qual_cup():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Германия") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Германия") or cup_winner == (df['Клубы'][2], df["Евроочки"][2], "Германия") or cup_winner == (df['Клубы'][3], df["Евроочки"][3], "Германия") or cup_winner == (df['Клубы'][4], df["Евроочки"][4], "Германия") or cup_winner == (df['Клубы'][5], df["Евроочки"][5], "Германия"):
        cup_winner = df['Клубы'][5], df["Евроочки"][5], "Германия" 
    return cup_winner
def conference_qual():
    if europe_qual_cup() == (df['Клубы'][5], df["Евроочки"][5], "Германия"):
        return df['Клубы'][6], df["Евроочки"][6], "Германия"
    else:
        return df['Клубы'][5], df["Евроочки"][5], "Германия"