import games
import pandas as pd
english_league = {
    'Клубы': ["Ноттингем Форест", "Астон Вилла", "Ливерпуль", "Ньюкасл", "Фулхэм", 
              "Лестер Сити", "Манчестер Сити", "Брентфорд", "Брайтон", "Борнмут", 
              "Саутгемптон", "Эвертон", "Манчестер Юнайтед", "Челси", "Бернли", 
              "Кристал Пэлас", "Тоттенхэм", "Арсенал", "Вест Хэм", "Сандерленд"],
    'Евроочки': ["8000", "57250", "115500", "21000", "0", 
                 "13000", "117750", "0", "16000", "0", 
                 "0", "0", "76500", "89000", "0", 
                 "8875", "69250", "93000", "69000", "0"], 
    'Очки силы': [6, 8, 9, 7, 5, 
                  3, 10, 6, 6, 5, 
                  3, 6, 8, 9, 2, 
                  6, 7, 9, 4, 5],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 20, english_league)
df = pd.DataFrame(english_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(20, english_league, "Англия")
# print(cup_winner)
def champions_qual_1():
    return df['Клубы'][0], df["Евроочки"][0], "Англия"
def champions_qual_2():
    return df['Клубы'][1], df["Евроочки"][1], "Англия"
def champions_qual_3():
    return df['Клубы'][2], df["Евроочки"][2], "Англия"
def champions_qual_4():
    return df['Клубы'][3], df["Евроочки"][3], "Англия"
def europe_qual():
    return df['Клубы'][4], df["Евроочки"][4], "Англия"
def europe_qual_cup():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Англия") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Англия") or cup_winner == (df['Клубы'][2], df["Евроочки"][2], "Англия") or cup_winner == (df['Клубы'][3], df["Евроочки"][3], "Англия") or cup_winner == (df['Клубы'][4], df["Евроочки"][4], "Англия") or cup_winner == (df['Клубы'][5], df["Евроочки"][5], "Англия"):
        cup_winner = df['Клубы'][5], df["Евроочки"][5], "Англия" 
    return cup_winner
def conference_qual():
    if europe_qual_cup() == (df['Клубы'][5], df["Евроочки"][5], "Англия"):
        return df['Клубы'][6], df["Евроочки"][6], "Англия"
    else:
        return df['Клубы'][5], df["Евроочки"][5], "Англия"
    