import games
import pandas as pd
georgian_league = {
    'Клубы': ["Динамо Тбилиси", "Локомотив Тбилиси", "Сиони", "Телави", "Дила",
              "Торпедо Кутаиси", "Динамо Батуми", "Иберия", "Самгурали", "Гагра"],
    'Евроочки': ["5000", "0", "0", "0", "5500",
                 "4500", "6000", "5000", "0", "1000"],
    'Очки силы': [10, 4, 3, 6, 5,
                  10, 7, 2, 7, 3],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(4, 10, georgian_league)
df = pd.DataFrame(georgian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(10, georgian_league, "Грузия")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Грузия"
def conference_qual():
    return df['Клубы'][1], df["Евроочки"][1], "Грузия"
