import games
import pandas as pd
greek_league = {
    'Клубы': ["Олимпиакос", "Астерас Триполи", "ПАОК", "Лариса", "Волос",
              "АЕК Афины", "ОФИ", "Кифисиа", "Панатинаикос", "Ламия",
              "Арис Салоники", "Панетоликос", "Атромитос", "Левадиакос"],
    'Евроочки': ["56500", "0", "44250", "0", "0", 
                 "19000", "0", "0", "23000", "0", 
                 "7000", "0", "0", "0"], 
    'Очки силы': [10, 4, 9, 4, 5,
                  8, 5, 3, 7, 3, 
                  6, 4, 5, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 14, greek_league)
df = pd.DataFrame(greek_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(14, greek_league, "Греция")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Греция" 
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Греция") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Греция"):
        cup_winner = df['Клубы'][1], df["Евроочки"][1], "Греция"
    return cup_winner
def conference_qual_1():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Греция"):
        return df['Клубы'][2], df["Евроочки"][2], "Греция"
    else:
        return df['Клубы'][1], df["Евроочки"][1], "Греция"
def conference_qual_2():
    if conference_qual_1() == (df['Клубы'][2], df["Евроочки"][2], "Греция"):
        return df['Клубы'][3], df["Евроочки"][3], "Греция"
    else:
        return df['Клубы'][2], df["Евроочки"][2], "Греция"