import games
import pandas as pd
romanian_league = {
    'Клубы': ["ФКСБ", "ЧФР Клуж", "Университатя Крайова", "Рапид Бухарест", "Херманштадт",
              "Университатя Клуж", "Петролул", "Фарул", "Политехника", "УТА Арад",
              "Динамо Бухарест", "Сепси", "Металлоглобус", "Оцелул", "Ботошани", "Слобозия"],
    'Евроочки': ["24500", "17500", "10500", "0", "0", 
                 "1500", "0", "2500", "0", "0", 
                 "0", "6000", "0", "0", "0", "0"],
    'Очки силы': [10, 9, 9, 6, 4,
                  4, 4, 7, 3, 6, 
                  4, 8, 2, 5, 3, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 16, romanian_league)
df = pd.DataFrame(romanian_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(16, romanian_league, "Румыния")
def champions_qual():
    return df['Клубы'][0], df["Евроочки"][0], "Румыния" 
def europe_qual():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Румыния") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Румыния"):
        cup_winner = df['Клубы'][1], df["Евроочки"][1], "Румыния"
    return cup_winner
def conference_qual_1():
    if cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Румыния"):
        return df['Клубы'][2], df["Евроочки"][2], "Румыния"
    else:
        return df['Клубы'][1], df["Евроочки"][1], "Румыния"
def conference_qual_2():
    if conference_qual_1() == (df['Клубы'][2], df["Евроочки"][2], "Румыния"):
        return df['Клубы'][3], df["Евроочки"][3], "Румыния"
    else:
        return df['Клубы'][2], df["Евроочки"][2], "Румыния"