import games
import pandas as pd
spanish_league = {
    'Клубы': ["Атлетик", "Реал Мадрид", "Атлетико Мадрид", "Бетис", "Кадис", 
              "Жирона", "Осасуна", "Барселона", "Мальорка", "Реал Сосьедад",
              "Райо Вальекано", "Севилья", "Сельта", "Вильярреал", "Хетафе", 
              "Валенсия", "Альмерия", "Реал Сарагоса", "Эспаньол", "Эльче"],
    'Евроочки': ["36750", "131500", "91500", "62250", "0", 
                 "8000", "2500", "96250", "0", "57000", 
                 "12000", "39000", "6000", "59000", "0", 
                 "0", "0", "0", "0", "0"], 
    'Очки силы': [7, 10, 9, 7, 3, 
                  4, 5, 9, 4, 8, 
                  6, 7, 7, 8, 5, 
                  4, 3, 2, 3, 2],
    'Игры': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Победы': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Ничьи': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Поражения': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Очки': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов забито': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Голов пропущено': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    'Разница мячей': [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
}
games.play_league(2, 20, spanish_league)
df = pd.DataFrame(spanish_league)
df = df.sort_values(
    by=['Очки', 'Голов забито', 'Разница мячей'], 
    ascending=[False, False, False]
)
df = df.reset_index(drop=True)
df['Место'] = df.index + 1
# print(df)
cup_winner = games.play_cup(20, spanish_league, "Испания")
def champions_qual_1():
    return df['Клубы'][0], df["Евроочки"][0], "Испания"
def champions_qual_2():
    return df['Клубы'][1], df["Евроочки"][1], "Испания"
def champions_qual_3():
    return df['Клубы'][2], df["Евроочки"][2], "Испания"
def champions_qual_4():
    return df['Клубы'][3], df["Евроочки"][3], "Испания"
def europe_qual():
    return df['Клубы'][4], df["Евроочки"][4], "Испания"
def europe_qual_cup():
    global cup_winner
    if cup_winner == (df['Клубы'][0], df["Евроочки"][0], "Испания") or cup_winner == (df['Клубы'][1], df["Евроочки"][1], "Испания") or cup_winner == (df['Клубы'][2], df["Евроочки"][2], "Испания") or cup_winner == (df['Клубы'][3], df["Евроочки"][3], "Испания") or cup_winner == (df['Клубы'][4], df["Евроочки"][4], "Испания") or cup_winner == (df['Клубы'][5], df["Евроочки"][5], "Испания"):
        cup_winner = df['Клубы'][5], df["Евроочки"][5], "Испания"
    return cup_winner
def conference_qual():
    if europe_qual_cup() == (df['Клубы'][5], df["Евроочки"][5], "Испания"):
        return df['Клубы'][6], df["Евроочки"][6], "Испания"
    else:
        return df['Клубы'][5], df["Евроочки"][5], "Испания"